package hp.com.retrofitdemo.bean;

import java.util.List;

/**
 * Created by tangdekun on 2017/2/5.
 */

public class SimpleBean {

    /**
     * error_code : 0
     * reason : Success
     * result : {"data":[{"content":"小情侣亲热时，因男友太激情，吻破女友耳膜。这听起来匪夷所思的事情，在现实生活中真的发生了。 2月3日上午10点，耳鼻喉科门诊来了一对小情侣。\u201c女生有27岁，当时问诊，她就说左耳疼痛，不知原因的耳鸣了一个晚上，我便为她做了电耳镜检查，发现她左侧耳朵鼓膜紧张部有个小穿孔，周围充血并且伴有听力下降。\u201d接诊医生陈宏鑫接受采访时说，经过再三询问女生才羞红着脸说，前一天晚上男友亲吻她左耳时太用力，突然间就一阵痛、听不清楚，随之出现耳鸣症状，一晚上都没有缓解。 医师表示，平均每月都会遇到几个耳膜破裂病例，原因多是外伤引起，因用力吸吮耳朵导致耳膜破裂还是第一次遇到。目前患者经微波治疗后，正观察耳膜愈合状况。 医师说，鼓膜穿孔会引起轻度的传导性耳聋，所幸大多在一个月内可自行愈合，否则就要手术修补，同时他也提醒广大市民朋友，情人节快到了，年轻情侣如果要以亲吻来表达爱意时请注意，尽量不要亲吻耳孔部位，因为鼓膜穿孔常因直接或间接的外力作用所致，如果用力不当，很容易导致鼓膜穿孔。 他提醒，万一鼓膜穿孔，首先要保持耳部干燥，防水入耳，不能游泳，洗头、洗澡时可用消毒棉球塞住耳道；其次要慎挖耳朵，防止不洁器具带入细菌。最后，还要注意定期到医院检查，发现问题及早处理。","hashId":"0b8b67b203319d6176429d3744b886d3","unixtime":1486263830,"updatetime":"2017-02-05 11:03:50"},{"content":"前不久用一枚５毛硬币，辛苦倒模，溶了二条金链子，翻了一枚金５毛，准备作为传家宝留给儿孙。　　今儿上午，被俺老婆当零钱花掉了，俺中午没吃饭，晚上没吃饭，心里堵，吃不下。","hashId":"6aca9747063a8b321d746df3fabb4f37","unixtime":1486259030,"updatetime":"2017-02-05 09:43:50"},{"content":"前几天妈妈去农贸市场买菠菜， 老爷爷说：\u201c2.5元2斤。\u201d 　　然后妈妈说：\u201c2元一斤，可以不？\u201d　　 老爷爷干脆利落的回答 ：\u201c不得行。\u201d","hashId":"542e5a793757f84b92713142b458963e","unixtime":1486259030,"updatetime":"2017-02-05 09:43:50"},{"content":"快要过年了，老总在办公室里突然发高烧，秘书敢快请医生过来。　　过了会儿，秘书说：\u201c总经理，大夫来了。\u201d　　总经理：\u201c告诉他我病得太厉害，不能见他。\u201d","hashId":"6a358f1ec16605f60087cd0f8efa3519","unixtime":1486259030,"updatetime":"2017-02-05 09:43:50"},{"content":"甲：\u201c经人介绍，我连续相亲十次，终于相到一个有缘的人。\u201d　　乙：\u201c有缘？怎么说？\u201d　　甲：\u201c他就是我第一次相亲的对象。\u201d","hashId":"64a638fd0ba0824efd34ce494e60b160","unixtime":1486259030,"updatetime":"2017-02-05 09:43:50"},{"content":"一个正在办派对的女人要她的老公提水桶跑到沙滩上去捡一些蜗牛，满心不愿的丈夫答应了妻子，但是这位丈夫却在沙滩上邂逅了一位美丽的女郎。　　隔天一早，他醒来时就惊呼：\u201c完了！我老婆的派对！\u201d他拾起所有衣物，以最快的速度把它们穿上，拿起水桶，冲向家里，由于他跑的太快，快到家的时候，不小心掉了水桶，弄得家门口都是蜗牛。　　此时，怒气冲冲地老婆出来了，他赶忙回头望着蜗牛道：\u201c加油啊！兄弟们，咱们就快到啦！\u201d","hashId":"63ff9e8436357c5684b26806c317f149","unixtime":1486259030,"updatetime":"2017-02-05 09:43:50"},{"content":"一个小伙子每天晚上在安格吉莎对面单元的窗口用望远镜看她，这使她很生气。　　有一天清晨，她打电话给那个小伙子：\u201c你好，我就是对面单元里的姑娘，你还记不记得，昨晚我脱下长筒袜子放在哪里了。\u201d","hashId":"402cf65489767076df9d8a707ddc28e8","unixtime":1486259030,"updatetime":"2017-02-05 09:43:50"},{"content":"      过完年上班公司第一次开会，我想放屁，但是又怕被别人听到，所以就故意把椅子拖动，制造声音，结果他妈的一不小心摔倒了，屁也放了。然后听后边有人说，我操，放屁把自己炸倒了！","hashId":"a2d7f1c6eca36199a643fc6ce1bbc41d","unixtime":1486259030,"updatetime":"2017-02-05 09:43:50"},{"content":"太上老君不能将孙悟空炼化的真正原因是：古时候炼丹炉是煤炭炉，最高只能达到1200℃左右。　　而孙悟空是石猴，主要成分二氧化硅，熔点1600℃左右，的确炼不掉。　　懂点科学知识多么重要！","hashId":"d321ecfb34220ec94c99119f401e9ee1","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"今天外出办事回单位，看到一女同事带着几个月的孩子在上班，孩子正好在吃奶。　　想过去逗逗，本来想夸：\u201c好白的孩子啊！\u201d一张嘴：\u201c好白的奶子啊！\u201d　　我现在不知道怎么回单位了，到现在还在外面站着！","hashId":"2e16ab89fcf974095667975ec725a6f6","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"一次和女朋友出去吃饭，花了95元，结账时发现没带钱包。　　好在我一哥们在附近上班，赶紧给他打电话，然后去找他借钱，把女朋友留在餐厅做人质。　　结果，我呼哧呼哧地借了100元钱，回来结账的时候，女朋友又点了一杯17元的奶昔。　　大姐，您至于这么渴吗？！","hashId":"23c8324f4e3b3c010bfb05f47bda7129","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"老婆：我想我累了，真的累了，我想休息一下，可能这一下会很久。　 　　你可能会认为我没有成功过，是只失败的狼。 　　但可以让我反驳一下吗，就这一次，以后都不会了，真的不会了。 　　我成功过，我娶到了你。","hashId":"f70871b1cf5e264f0a8316b8b947e105","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"新应聘到宝洁公司的一个分销公司工作，脑子还没转过来。　　就今儿，分区领导视察工作，会议结束后合照，摄影师喊：\u201c3、2、1。\u201d　　我TM不知怎么脑抽，喊道：\u201c田七！\u201d　　顿时从上到下笑容全部僵住\u2026\u2026","hashId":"8c13ab7c28396fa2fceae47afe9219e1","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"今天坐火车，两个老婆婆坐在我身边，其中一个是来送另一个的，俩人双手拉在一起不停地念叨着。　　要发车了，一个老婆婆下车，回头说了句话，差点把我眼泪逼出来\u2014\u2014\u2014\u201c姐啊，今年我89岁，你90岁，这可能是我们这辈子最后一次见面了\u2026\u2026\u201d","hashId":"13626b14ab646bc676406e54c3de6f19","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"学校规定老师上课不许接电话。　　一天，我们上物理课，老师电话响了。老师纠结地看了半天，问我们：\u201c领导电话，接不？\u201d我们回答：\u201c必须接！\u201d　　然后老师出去大喊一句：\u201c老婆干啥啊？我上课呢！\u201d","hashId":"bea840aa747a5731d9a50a99021af301","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"一天，去某百货公司买东西，看到一男子和一小孩，穿着短裤站在某百货公司门口。　　男子和小孩应该是父子关系吧，很多经过都说这俩个人是神经病。　　而这俩个人却说：\u201c我俩是海尔兄弟!\u201d","hashId":"1fb88c011d2d8201b275d0f7a7e24909","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"一对父子在亲戚家吃好饭回家，路口一警察在查酒驾。　　老爸拿起酒精检测仪器就吹，酒精含量超标。　　老爸对警察说：这仪器肯定坏了，不信你让我儿子吹.儿子（大概五六岁）拿起来吹，还是超标。　　警察郁闷的拿起仪器看看：真的坏了啊！！原来孩子也喝了两杯白酒。","hashId":"dca4dab103bc640ba6ca06810b68c0e1","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"小明在一家五星级酒店上班，都三年时间没回去过年了。　　每年这个时候向经理请假，经理都说不行，小明为此非常不高兴。　　一同事见小明闷闷不乐，安慰小明说：\u201c想想灰太狼，我们现在这一点苦又算什么呢？\u201d","hashId":"7c9d9c394bfa4227acb41dcf0deda1fa","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"春节将至，小王便给老总发了个短信问候。　　片刻即收到回信，小王心想老总还真客气，但打开一看却了傻了眼。　　只见上面写着：\u201c春节期间公司没人值班不太安全，要不你就辛苦一下吧。\u201d","hashId":"a04893ac7cb44094083275cc7daeec03","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"},{"content":"一天坐公交车时，有个长的很猥琐的男子，不住的朝一妙龄女子，不住的淫笑，指手画脚，那女子开始一直忍着，脸气的发青，手都发抖，最后实在忍无可忍，从座位上站起来，走到那猥琐男子面前，扬手就是一把掌，那人愣了下，到你干啥啊！，　　女子说道：\u201c流氓啊你！\u201d　　男子捂着手说道：\u201c哪有我一直在跟女儿手语对话呢！，她是哑巴。\u201d　　那女子回头一看，后边座位上坐着个瑟瑟的女孩。","hashId":"b76c3310580fc37b999d6d45dfd0a61b","unixtime":1486258430,"updatetime":"2017-02-05 09:33:50"}]}
     */

    private int error_code;
    private String reason;
    private ResultSimple result;

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public String getReason() {
        return reason;
    }

    public void setReason(String reason) {
        this.reason = reason;
    }

    public ResultSimple getResult() {
        return result;
    }

    public void setResult(ResultSimple result) {
        this.result = result;
    }

    public static class ResultSimple {
        private List<DataSimple> data;

        public List<DataSimple> getData() {
            return data;
        }

        public void setData(List<DataSimple> data) {
            this.data = data;
        }

        public static class DataSimple {
            /**
             * content : 小情侣亲热时，因男友太激情，吻破女友耳膜。这听起来匪夷所思的事情，在现实生活中真的发生了。 2月3日上午10点，耳鼻喉科门诊来了一对小情侣。“女生有27岁，当时问诊，她就说左耳疼痛，不知原因的耳鸣了一个晚上，我便为她做了电耳镜检查，发现她左侧耳朵鼓膜紧张部有个小穿孔，周围充血并且伴有听力下降。”接诊医生陈宏鑫接受采访时说，经过再三询问女生才羞红着脸说，前一天晚上男友亲吻她左耳时太用力，突然间就一阵痛、听不清楚，随之出现耳鸣症状，一晚上都没有缓解。 医师表示，平均每月都会遇到几个耳膜破裂病例，原因多是外伤引起，因用力吸吮耳朵导致耳膜破裂还是第一次遇到。目前患者经微波治疗后，正观察耳膜愈合状况。 医师说，鼓膜穿孔会引起轻度的传导性耳聋，所幸大多在一个月内可自行愈合，否则就要手术修补，同时他也提醒广大市民朋友，情人节快到了，年轻情侣如果要以亲吻来表达爱意时请注意，尽量不要亲吻耳孔部位，因为鼓膜穿孔常因直接或间接的外力作用所致，如果用力不当，很容易导致鼓膜穿孔。 他提醒，万一鼓膜穿孔，首先要保持耳部干燥，防水入耳，不能游泳，洗头、洗澡时可用消毒棉球塞住耳道；其次要慎挖耳朵，防止不洁器具带入细菌。最后，还要注意定期到医院检查，发现问题及早处理。
             * hashId : 0b8b67b203319d6176429d3744b886d3
             * unixtime : 1486263830
             * updatetime : 2017-02-05 11:03:50
             */

            private String content;
            private String hashId;
            private int unixtime;
            private String updatetime;

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public String getHashId() {
                return hashId;
            }

            public void setHashId(String hashId) {
                this.hashId = hashId;
            }

            public int getUnixtime() {
                return unixtime;
            }

            public void setUnixtime(int unixtime) {
                this.unixtime = unixtime;
            }

            public String getUpdatetime() {
                return updatetime;
            }

            public void setUpdatetime(String updatetime) {
                this.updatetime = updatetime;
            }
        }
    }
}
